Revit 2026 API

# PointOnFace Methods

---

The PointOnFace type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetFaceReference | Get a copy of the face reference. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetFaceReference | Change the face reference. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

PointOnFace Class

Autodesk.Revit.DB Namespace